{
  "_name_or_path": "distilbert/distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "B-geo",
    "1": "B-gpe",
    "2": "B-org",
    "3": "B-per",
    "4": "B-tim",
    "5": "I-geo",
    "6": "I-gpe",
    "7": "I-org",
    "8": "I-per",
    "9": "I-tim",
    "10": "O"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-geo": 0,
    "B-gpe": 1,
    "B-org": 2,
    "B-per": 3,
    "B-tim": 4,
    "I-geo": 5,
    "I-gpe": 6,
    "I-org": 7,
    "I-per": 8,
    "I-tim": 9,
    "O": 10
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.45.2",
  "vocab_size": 30522
}
